TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the BLANKPULSEMIXSEL register
//
//*************************************************************************************************
#define EPWM_BLANKPULSEMIXSEL_ZRO   0x1U     // Zero match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_PRD   0x2U     // Period match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CAU   0x4U     // CMPA up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CAD   0x8U     // CMPA down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CBU   0x10U    // CMPB up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CBD   0x20U    // CMPB down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CCU   0x40U    // CMPC up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CCD   0x80U    // CMPC down-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CDU   0x100U   // CMPD up-count match enable to BLANKPULSEMIX
#define EPWM_BLANKPULSEMIXSEL_CDD   0x200U   // CMPD down-count match enable to BLANKPULSEMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCCAPMIXSEL register
//
//*************************************************************************************************
#define EPWM_DCCAPMIXSEL_ZRO   0x1U     // Zero match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_PRD   0x2U     // Period match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CAU   0x4U     // CMPA up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CAD   0x8U     // CMPA down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CBU   0x10U    // CMPB up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CBD   0x20U    // CMPB down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CCU   0x40U    // CMPC up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CCD   0x80U    // CMPC down-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CDU   0x100U   // CMPD up-count match enable to DCCAPMIX
#define EPWM_DCCAPMIXSEL_CDD   0x200U   // CMPD down-count match enable to DCCAPMIX

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCAHTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCAHTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCAH Mux
#define EPWM_DCAHTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCAH Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCALTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCALTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCAL Mux
#define EPWM_DCALTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCAL Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBHTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCBHTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCBH Mux
#define EPWM_DCBHTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCBH Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCBLTRIPSEL register
//
//*************************************************************************************************
#define EPWM_DCBLTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to DCBL Mux
#define EPWM_DCBLTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to DCBL Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPCTL register
//
//*************************************************************************************************
#define EPWM_CAPCTL_SRCSEL         0x1U     // Capture Logic Input Selection
#define EPWM_CAPCTL_CAPGATEPOL_S   1U
#define EPWM_CAPCTL_CAPGATEPOL_M   0x6U     // Polarity selection for Capture Gate input
#define EPWM_CAPCTL_CAPINPOL       0x8U     // Polarity selection for Capture input
#define EPWM_CAPCTL_PULSECTL       0x10U    // Polarity selection for Capture input
#define EPWM_CAPCTL_FRCLOAD        0x100U   // Capture event force load

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPGATETRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPGATETRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPGATE Mux
#define EPWM_CAPGATETRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPGATE Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPINTRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPINTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPIN Mux
#define EPWM_CAPINTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPIN Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPTRIPSEL register
//
//*************************************************************************************************
#define EPWM_CAPTRIPSEL_CAPINCOMPSEL_S     0U
#define EPWM_CAPTRIPSEL_CAPINCOMPSEL_M     0xFU    // CAPIN Comparator Input Select
#define EPWM_CAPTRIPSEL_CAPGATECOMPSEL_S   4U
#define EPWM_CAPTRIPSEL_CAPGATECOMPSEL_M   0xF0U   // CAPGATE Comparator COMP Input Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMLOCK register
//
//*************************************************************************************************
#define EPWM_LOCK_HRLOCK      0x1U          // HRPWM Register Set Lock
#define EPWM_LOCK_GLLOCK      0x2U          // Global Load Register Set Lock
#define EPWM_LOCK_TZCFGLOCK   0x4U          // TripZone Register Set Lock
#define EPWM_LOCK_TZCLRLOCK   0x8U          // TripZone Clear Register Set Lock
#define EPWM_LOCK_DCLOCK      0x10U         // Digital Compare Register Set Lock
#define EPWM_LOCK_KEY_S       16U
#define EPWM_LOCK_KEY_M       0xFFFF0000U   // Key to write to this register


//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMPCTL1 register
//
//*************************************************************************************************
#define EPWM_XCMPCTL1_XCMPEN          0x1U     // XCMP Compare Register Operation Enable
#define EPWM_XCMPCTL1_XCMPSPLIT       0x2U     // XCMP Register Allocation Options
#define EPWM_XCMPCTL1_XCMPA_ALLOC_S   4U
#define EPWM_XCMPCTL1_XCMPA_ALLOC_M   0xF0U    // XCMPn register allocation for CMPA
#define EPWM_XCMPCTL1_XCMPB_ALLOC_S   8U
#define EPWM_XCMPCTL1_XCMPB_ALLOC_M   0xF00U   // XCMPn register allocation for CMPB

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOADCTL register
//
//*************************************************************************************************
#define EPWM_XLOADCTL_LOADMODE                    0x4U          // Load mode selection for Shadow
                                                                // registers
#define EPWM_XLOADCTL_SHDWLEVEL_S                 4U
#define EPWM_XLOADCTL_SHDWLEVEL_M                 0x30U         // Shadow Register Level Allocation
                                                                // Options
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_S       8U
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_M       0x300U        // Register Load event count
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_S   10U
#define EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_M   0xC00U        // Register Load event count
#define EPWM_XLOADCTL_RPTBUF2PRD_S                16U
#define EPWM_XLOADCTL_RPTBUF2PRD_M                0x70000U      // Repeat Count Shadow Buffer 2
#define EPWM_XLOADCTL_RPTBUF2CNT_S                20U
#define EPWM_XLOADCTL_RPTBUF2CNT_M                0x700000U     // Repeat Count Status Shadow
                                                                // Buffer 2
#define EPWM_XLOADCTL_RPTBUF3PRD_S                24U
#define EPWM_XLOADCTL_RPTBUF3PRD_M                0x7000000U    // Repeat Count Shadow Buffer 3
#define EPWM_XLOADCTL_RPTBUF3CNT_S                28U
#define EPWM_XLOADCTL_RPTBUF3CNT_M                0x70000000U   // Repeat Count Status Shadow
                                                                // Buffer 3

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOAD register
//
//*************************************************************************************************
#define EPWM_XLOAD_STARTLD   0x1U   // Enable register loading of shadow buffers
#define EPWM_XLOAD_FRCLD     0x2U   // Force register loading of shadow buffers

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINKXLOAD register
//
//*************************************************************************************************
#define EPWM_XLINKXLOAD_XLOADLINK_S   0U
#define EPWM_XLINKXLOAD_XLOADLINK_M   0x1FU   // XLOAD  Link Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW1STS register
//
//*************************************************************************************************
#define EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL     0x1U      // XCMP1_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL     0x2U      // XCMP2_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL     0x4U      // XCMP3_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL     0x8U      // XCMP4_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL     0x10U     // XCMP5_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL     0x20U     // XCMP6_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL     0x40U     // XCMP7_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL     0x80U     // XCMP8_SHDW1 register full Status flag
#define EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL    0x100U    // XTBPRD_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_CMPC_SHDW1FULL      0x200U    // CMPC_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_CMPD_SHDW1FULL      0x400U    // CMPD_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL   0x800U    // XAQCTLA_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL   0x1000U   // XAQCTLB_SHDW1 register full Status flag:
#define EPWM_XREGSHDW1STS_XMAX_SHDW1FULL      0x2000U   // XMINMAX_SHDW1 register full Status
                                                        // flag:MAX field update
#define EPWM_XREGSHDW1STS_XMIN_SHDW1FULL      0x4000U   // XMINMAX_SHDW1 register full Status flag:
                                                        // MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW2STS register
//
//*************************************************************************************************
#define EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL     0x1U      // XCMP1_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL     0x2U      // XCMP2_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL     0x4U      // XCMP3_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL     0x8U      // XCMP4_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL     0x10U     // XCMP5_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL     0x20U     // XCMP6_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL     0x40U     // XCMP7_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL     0x80U     // XCMP8_SHDW2 register full Status flag
#define EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL    0x100U    // XTBPRD_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_CMPC_SHDW2FULL      0x200U    // CMPC_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_CMPD_SHDW2FULL      0x400U    // CMPD_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL   0x800U    // XAQCTLA_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL   0x1000U   // XAQCTLB_SHDW2 register full Status flag:
#define EPWM_XREGSHDW2STS_XMAX_SHDW2FULL      0x2000U   // XMINMAX_SHDW2 register full Status
                                                        // flag:MAX field update
#define EPWM_XREGSHDW2STS_XMIN_SHDW2FULL      0x4000U   // XMINMAX_SHDW2 register full Status flag:
                                                        // MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW3STS register
//
//*************************************************************************************************
#define EPWM_XREGSHDW3STS_XCMP1_SHDW3FULL     0x1U      // XCMP1_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP2_SHDW3FULL     0x2U      // XCMP2_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP3_SHDW3FULL     0x4U      // XCMP3_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP4_SHDW3FULL     0x8U      // XCMP4_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP5_SHDW3FULL     0x10U     // XCMP5_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP6_SHDW3FULL     0x20U     // XCMP6_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP7_SHDW3FULL     0x40U     // XCMP7_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XCMP8_SHDW3FULL     0x80U     // XCMP8_SHDW3 register full Status flag
#define EPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL    0x100U    // XTBPRD_SHDW3 register full Status flag:
#define EPWM_XREGSHDW3STS_CMPC_SHDW3FULL      0x200U    // CMPC_SHDW3 register full Status flag:
#define EPWM_XREGSHDW3STS_CMPD_SHDW3FULL      0x400U    // CMPD_SHDW3 register full Status flag:
#define EPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL   0x800U    // XAQCTLA_SHDW3 register full Status flag:
#define EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL   0x1000U   // XAQCTLB_SHDW3 register full Status flag:
#define EPWM_XREGSHDW3STS_XMAX_SHDW3FULL      0x2000U   // XMINMAX_SHDW3 register full Status
                                                        // flag:MAX field update
#define EPWM_XREGSHDW3STS_XMIN_SHDW3FULL      0x4000U   // XMINMAX_SHDW3 register full Status flag:
                                                        // MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_S   0U
#define EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_M   0xFFFFU       // Additional Compare 1 Active HR
                                                           // Register
#define EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_S     16U
#define EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_M     0xFFFF0000U   // Additional Compare 1 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_S   0U
#define EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_M   0xFFFFU       // Additional Compare 2 Active HR
                                                           // Register
#define EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_S     16U
#define EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_M     0xFFFF0000U   // Additional Compare 2 Active Register

