TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_S   0U
#define EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_M   0xFFFFU       // Additional Compare 3 Active HR
                                                           // Register
#define EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_S     16U
#define EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_M     0xFFFF0000U   // Additional Compare 3 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_S   0U
#define EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_M   0xFFFFU       // Additional Compare 4 Active HR
                                                           // Register
#define EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_S     16U
#define EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_M     0xFFFF0000U   // Additional Compare 4 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_S   0U
#define EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_M   0xFFFFU       // Additional Compare 5 Active HR
                                                           // Register
#define EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_S     16U
#define EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_M     0xFFFF0000U   // Additional Compare 5 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_S   0U
#define EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_M   0xFFFFU       // Additional Compare 6 Active HR
                                                           // Register
#define EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_S     16U
#define EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_M     0xFFFF0000U   // Additional Compare 6 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_S   0U
#define EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_M   0xFFFFU       // Additional Compare 7 Active HR
                                                           // Register
#define EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_S     16U
#define EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_M     0xFFFF0000U   // Additional Compare 7 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_S   0U
#define EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_M   0xFFFFU       // Additional Compare 8 Active HR
                                                           // Register
#define EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_S     16U
#define EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_M     0xFFFF0000U   // Additional Compare 8 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_S   0U
#define EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_M   0xFFFFU       // Additional Time Base Period Active
                                                             // HR Register
#define EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_S     16U
#define EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_M     0xFFFF0000U   // Additional Time Base Period Active
                                                             // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_ACTIVE_XCMP1_S   0U
#define EPWM_XAQCTLA_ACTIVE_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP2_S   2U
#define EPWM_XAQCTLA_ACTIVE_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP3_S   4U
#define EPWM_XAQCTLA_ACTIVE_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP4_S   6U
#define EPWM_XAQCTLA_ACTIVE_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP5_S   8U
#define EPWM_XAQCTLA_ACTIVE_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP6_S   10U
#define EPWM_XAQCTLA_ACTIVE_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP7_S   12U
#define EPWM_XAQCTLA_ACTIVE_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_ACTIVE_XCMP8_S   14U
#define EPWM_XAQCTLA_ACTIVE_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_ACTIVE_XCMP5_S   8U
#define EPWM_XAQCTLB_ACTIVE_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_ACTIVE_XCMP6_S   10U
#define EPWM_XAQCTLB_ACTIVE_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_ACTIVE_XCMP7_S   12U
#define EPWM_XAQCTLB_ACTIVE_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_ACTIVE_XCMP8_S   14U
#define EPWM_XAQCTLB_ACTIVE_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_ACTIVE register
//
//*************************************************************************************************
#define EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_S   0U
#define EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                          // Active Register
#define EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_S   16U
#define EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                          // Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_S   0U
#define EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_M   0xFFFFU       // Additional Compare 1 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP1_SHDW1_XCMP1_SHDW1_S     16U
#define EPWM_XCMP1_SHDW1_XCMP1_SHDW1_M     0xFFFF0000U   // Additional Compare 1 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_S   0U
#define EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_M   0xFFFFU       // Additional Compare 2 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP2_SHDW1_XCMP2_SHDW1_S     16U
#define EPWM_XCMP2_SHDW1_XCMP2_SHDW1_M     0xFFFF0000U   // Additional Compare 2 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_S   0U
#define EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_M   0xFFFFU       // Additional Compare 3 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP3_SHDW1_XCMP3_SHDW1_S     16U
#define EPWM_XCMP3_SHDW1_XCMP3_SHDW1_M     0xFFFF0000U   // Additional Compare 3 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_S   0U
#define EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_M   0xFFFFU       // Additional Compare 4 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP4_SHDW1_XCMP4_SHDW1_S     16U
#define EPWM_XCMP4_SHDW1_XCMP4_SHDW1_M     0xFFFF0000U   // Additional Compare 4 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_S   0U
#define EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_M   0xFFFFU       // Additional Compare 5 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP5_SHDW1_XCMP5_SHDW1_S     16U
#define EPWM_XCMP5_SHDW1_XCMP5_SHDW1_M     0xFFFF0000U   // Additional Compare 5 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_S   0U
#define EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_M   0xFFFFU       // Additional Compare 6 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP6_SHDW1_XCMP6_SHDW1_S     16U
#define EPWM_XCMP6_SHDW1_XCMP6_SHDW1_M     0xFFFF0000U   // Additional Compare 6 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP7_SHDW1_XCMP7HR_SHDW1_S   0U
#define EPWM_XCMP7_SHDW1_XCMP7HR_SHDW1_M   0xFFFFU       // Additional Compare 7 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP7_SHDW1_XCMP7_SHDW1_S     16U
#define EPWM_XCMP7_SHDW1_XCMP7_SHDW1_M     0xFFFF0000U   // Additional Compare 7 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XCMP8_SHDW1_XCMP8HR_SHDW1_S   0U
#define EPWM_XCMP8_SHDW1_XCMP8HR_SHDW1_M   0xFFFFU       // Additional Compare 8 Shadow 1 HR
                                                         // Register
#define EPWM_XCMP8_SHDW1_XCMP8_SHDW1_S     16U
#define EPWM_XCMP8_SHDW1_XCMP8_SHDW1_M     0xFFFF0000U   // Additional Compare 8 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XTBPRD_SHDW1_XTBPRDHR_SHDW1_S   0U
#define EPWM_XTBPRD_SHDW1_XTBPRDHR_SHDW1_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                           // HR Register
#define EPWM_XTBPRD_SHDW1_XTBPRD_SHDW1_S     16U
#define EPWM_XTBPRD_SHDW1_XTBPRD_SHDW1_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                           // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_SHDW1_XCMP1_S   0U
#define EPWM_XAQCTLA_SHDW1_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_SHDW1_XCMP2_S   2U
#define EPWM_XAQCTLA_SHDW1_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_SHDW1_XCMP3_S   4U
#define EPWM_XAQCTLA_SHDW1_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_SHDW1_XCMP4_S   6U
#define EPWM_XAQCTLA_SHDW1_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_SHDW1_XCMP5_S   8U
#define EPWM_XAQCTLA_SHDW1_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_SHDW1_XCMP6_S   10U
#define EPWM_XAQCTLA_SHDW1_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_SHDW1_XCMP7_S   12U
#define EPWM_XAQCTLA_SHDW1_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_SHDW1_XCMP8_S   14U
#define EPWM_XAQCTLA_SHDW1_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_SHDW1_XCMP5_S   8U
#define EPWM_XAQCTLB_SHDW1_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_SHDW1_XCMP6_S   10U
#define EPWM_XAQCTLB_SHDW1_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_SHDW1_XCMP7_S   12U
#define EPWM_XAQCTLB_SHDW1_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_SHDW1_XCMP8_S   14U
#define EPWM_XAQCTLB_SHDW1_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW1 register
//
//*************************************************************************************************
#define EPWM_XMINMAX_SHDW1_XMAX_SHDW1_S   0U
#define EPWM_XMINMAX_SHDW1_XMAX_SHDW1_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                        // Active Register
#define EPWM_XMINMAX_SHDW1_XMIN_SHDW1_S   16U
#define EPWM_XMINMAX_SHDW1_XMIN_SHDW1_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                        // Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_S   0U
#define EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_M   0xFFFFU       // Additional Compare 1 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP1_SHDW2_XCMP1_SHDW2_S     16U
#define EPWM_XCMP1_SHDW2_XCMP1_SHDW2_M     0xFFFF0000U   // Additional Compare 1 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_S   0U
#define EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_M   0xFFFFU       // Additional Compare 2 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP2_SHDW2_XCMP2_SHDW2_S     16U
#define EPWM_XCMP2_SHDW2_XCMP2_SHDW2_M     0xFFFF0000U   // Additional Compare 2 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_S   0U
#define EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_M   0xFFFFU       // Additional Compare 3 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP3_SHDW2_XCMP3_SHDW2_S     16U
#define EPWM_XCMP3_SHDW2_XCMP3_SHDW2_M     0xFFFF0000U   // Additional Compare 3 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_S   0U
#define EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_M   0xFFFFU       // Additional Compare 4 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP4_SHDW2_XCMP4_SHDW2_S     16U
#define EPWM_XCMP4_SHDW2_XCMP4_SHDW2_M     0xFFFF0000U   // Additional Compare 4 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_S   0U
#define EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_M   0xFFFFU       // Additional Compare 5 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP5_SHDW2_XCMP5_SHDW2_S     16U
#define EPWM_XCMP5_SHDW2_XCMP5_SHDW2_M     0xFFFF0000U   // Additional Compare 5 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_S   0U
#define EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_M   0xFFFFU       // Additional Compare 6 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP6_SHDW2_XCMP6_SHDW2_S     16U
#define EPWM_XCMP6_SHDW2_XCMP6_SHDW2_M     0xFFFF0000U   // Additional Compare 6 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_S   0U
#define EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_M   0xFFFFU       // Additional Compare 7 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP7_SHDW2_XCMP7_SHDW2_S     16U
#define EPWM_XCMP7_SHDW2_XCMP7_SHDW2_M     0xFFFF0000U   // Additional Compare 7 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_S   0U
#define EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_M   0xFFFFU       // Additional Compare 8 Shadow 2 HR
                                                         // Register
#define EPWM_XCMP8_SHDW2_XCMP8_SHDW2_S     16U
#define EPWM_XCMP8_SHDW2_XCMP8_SHDW2_M     0xFFFF0000U   // Additional Compare 8 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_S   0U
#define EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                           // HR Register
#define EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_S     16U
#define EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                           // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_SHDW2_XCMP1_S   0U
#define EPWM_XAQCTLA_SHDW2_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_SHDW2_XCMP2_S   2U
#define EPWM_XAQCTLA_SHDW2_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_SHDW2_XCMP3_S   4U
#define EPWM_XAQCTLA_SHDW2_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_SHDW2_XCMP4_S   6U
#define EPWM_XAQCTLA_SHDW2_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_SHDW2_XCMP5_S   8U
#define EPWM_XAQCTLA_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_SHDW2_XCMP6_S   10U
#define EPWM_XAQCTLA_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_SHDW2_XCMP7_S   12U
#define EPWM_XAQCTLA_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_SHDW2_XCMP8_S   14U
#define EPWM_XAQCTLA_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_SHDW2_XCMP5_S   8U
#define EPWM_XAQCTLB_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_SHDW2_XCMP6_S   10U
#define EPWM_XAQCTLB_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_SHDW2_XCMP7_S   12U
#define EPWM_XAQCTLB_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_SHDW2_XCMP8_S   14U
#define EPWM_XAQCTLB_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW2 register
//
//*************************************************************************************************
#define EPWM_XMINMAX_SHDW2_XMAX_SHDW2_S   0U
#define EPWM_XMINMAX_SHDW2_XMAX_SHDW2_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                        // Active Register
#define EPWM_XMINMAX_SHDW2_XMIN_SHDW2_S   16U
#define EPWM_XMINMAX_SHDW2_XMIN_SHDW2_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                        // Active Register

