TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_epwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_S   0U
#define EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_M   0xFFFFU       // Additional Compare 1 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP1_SHDW3_XCMP1_SHDW3_S     16U
#define EPWM_XCMP1_SHDW3_XCMP1_SHDW3_M     0xFFFF0000U   // Additional Compare 1 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_S   0U
#define EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_M   0xFFFFU       // Additional Compare 2 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP2_SHDW3_XCMP2_SHDW3_S     16U
#define EPWM_XCMP2_SHDW3_XCMP2_SHDW3_M     0xFFFF0000U   // Additional Compare 2 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_S   0U
#define EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_M   0xFFFFU       // Additional Compare 3 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP3_SHDW3_XCMP3_SHDW3_S     16U
#define EPWM_XCMP3_SHDW3_XCMP3_SHDW3_M     0xFFFF0000U   // Additional Compare 3 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_S   0U
#define EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_M   0xFFFFU       // Additional Compare 4 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP4_SHDW3_XCMP4_SHDW3_S     16U
#define EPWM_XCMP4_SHDW3_XCMP4_SHDW3_M     0xFFFF0000U   // Additional Compare 4 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_S   0U
#define EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_M   0xFFFFU       // Additional Compare 5 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP5_SHDW3_XCMP5_SHDW3_S     16U
#define EPWM_XCMP5_SHDW3_XCMP5_SHDW3_M     0xFFFF0000U   // Additional Compare 5 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_S   0U
#define EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_M   0xFFFFU       // Additional Compare 6 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP6_SHDW3_XCMP6_SHDW3_S     16U
#define EPWM_XCMP6_SHDW3_XCMP6_SHDW3_M     0xFFFF0000U   // Additional Compare 6 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_S   0U
#define EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_M   0xFFFFU       // Additional Compare 7 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP7_SHDW3_XCMP7_SHDW3_S     16U
#define EPWM_XCMP7_SHDW3_XCMP7_SHDW3_M     0xFFFF0000U   // Additional Compare 7 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_S   0U
#define EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_M   0xFFFFU       // Additional Compare 8 Shadow 3 HR
                                                         // Register
#define EPWM_XCMP8_SHDW3_XCMP8_SHDW3_S     16U
#define EPWM_XCMP8_SHDW3_XCMP8_SHDW3_M     0xFFFF0000U   // Additional Compare 8 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_S   0U
#define EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                           // HR Register
#define EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_S     16U
#define EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                           // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XAQCTLA_SHDW3_XCMP1_S   0U
#define EPWM_XAQCTLA_SHDW3_XCMP1_M   0x3U      // XCMP1 Action
#define EPWM_XAQCTLA_SHDW3_XCMP2_S   2U
#define EPWM_XAQCTLA_SHDW3_XCMP2_M   0xCU      // XCMP2 Action
#define EPWM_XAQCTLA_SHDW3_XCMP3_S   4U
#define EPWM_XAQCTLA_SHDW3_XCMP3_M   0x30U     // XCMP3 Action
#define EPWM_XAQCTLA_SHDW3_XCMP4_S   6U
#define EPWM_XAQCTLA_SHDW3_XCMP4_M   0xC0U     // XCMP4 Action
#define EPWM_XAQCTLA_SHDW3_XCMP5_S   8U
#define EPWM_XAQCTLA_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLA_SHDW3_XCMP6_S   10U
#define EPWM_XAQCTLA_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLA_SHDW3_XCMP7_S   12U
#define EPWM_XAQCTLA_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLA_SHDW3_XCMP8_S   14U
#define EPWM_XAQCTLA_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XAQCTLB_SHDW3_XCMP5_S   8U
#define EPWM_XAQCTLB_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define EPWM_XAQCTLB_SHDW3_XCMP6_S   10U
#define EPWM_XAQCTLB_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define EPWM_XAQCTLB_SHDW3_XCMP7_S   12U
#define EPWM_XAQCTLB_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define EPWM_XAQCTLB_SHDW3_XCMP8_S   14U
#define EPWM_XAQCTLB_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW3 register
//
//*************************************************************************************************
#define EPWM_XMINMAX_SHDW3_XMAX_SHDW3_S   0U
#define EPWM_XMINMAX_SHDW3_XMAX_SHDW3_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                        // Active Register
#define EPWM_XMINMAX_SHDW3_XMIN_SHDW3_S   16U
#define EPWM_XMINMAX_SHDW3_XMIN_SHDW3_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                        // Active Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the DECTL register
//
//*************************************************************************************************
#define EPWM_DECTL_ENABLE         0x1U      // DE function enable.
#define EPWM_DECTL_MODE           0x2U      // DE Mode
#define EPWM_DECTL_REENTRYDLY_S   8U
#define EPWM_DECTL_REENTRYDLY_M   0xFF00U   // Re-entry delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECOMPSEL register
//
//*************************************************************************************************
#define EPWM_DECOMPSEL_TRIPL_S   0U
#define EPWM_DECOMPSEL_TRIPL_M   0x3FU       // Comparator TRIPL source select.
#define EPWM_DECOMPSEL_TRIPH_S   16U
#define EPWM_DECOMPSEL_TRIPH_M   0x3F0000U   // Comparator TRIPH source select.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEACTCTL register
//
//*************************************************************************************************
#define EPWM_DEACTCTL_PWMA_S       0U
#define EPWM_DEACTCTL_PWMA_M       0x3U       // Comparator source select.
#define EPWM_DEACTCTL_TRIPSELA     0x4U       // Trip source select on PWMA output
#define EPWM_DEACTCTL_PWMB_S       4U
#define EPWM_DEACTCTL_PWMB_M       0x30U      // Comparator source select.
#define EPWM_DEACTCTL_TRIPSELB     0x40U      // Trip source select on PWMB output
#define EPWM_DEACTCTL_TRIPENABLE   0x10000U   // Enables PWMTRIP condition to bypassDiode emulation
                                              // logic.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DESTS register
//
//*************************************************************************************************
#define EPWM_DESTS_DEACTIVE   0x1U   // Diode Emulation mode active flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEFRC register
//
//*************************************************************************************************
#define EPWM_DEFRC_DEACTIVE   0x1U   // Diode Emulation mode active flag force.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECLR register
//
//*************************************************************************************************
#define EPWM_DECLR_DEACTIVE   0x1U   // Diode Emulation mode active flag clear.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCNT register
//
//*************************************************************************************************
#define EPWM_DEMONCNT_CNT_S   0U
#define EPWM_DEMONCNT_CNT_M   0xFFFFU   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCTL register
//
//*************************************************************************************************
#define EPWM_DEMONCTL_ENABLE   0x1U   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONSTEP register
//
//*************************************************************************************************
#define EPWM_DEMONSTEP_INCSTEP_S   0U
#define EPWM_DEMONSTEP_INCSTEP_M   0xFFU       // DE monitor counter increment step.
#define EPWM_DEMONSTEP_DECSTEP_S   16U
#define EPWM_DEMONSTEP_DECSTEP_M   0xFF0000U   // DE monitor counter decrement step.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONTHRES register
//
//*************************************************************************************************
#define EPWM_DEMONTHRES_THRESHOLD_S   0U
#define EPWM_DEMONTHRES_THRESHOLD_M   0xFFFFU   // DE monitor counter compare threshold.


//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBCFG register
//
//*************************************************************************************************
#define EPWM_MINDBCFG_ENABLEA     0x1U         // Minimum dead band logic enable on PWMA
#define EPWM_MINDBCFG_INVERTA     0x4U         // Invert the selected reference signal on PWMA
#define EPWM_MINDBCFG_SELBLOCKA   0x8U         // BLOCK signal source select on PWMA
#define EPWM_MINDBCFG_SELA_S      4U
#define EPWM_MINDBCFG_SELA_M      0xF0U        // Reference source select on PWMA min dead band
                                               // logic.
#define EPWM_MINDBCFG_POLSELA     0x100U       // Select signal for the AND OR logic of PWMA
#define EPWM_MINDBCFG_ENABLEB     0x10000U     // Minimum dead band logic enable on PWMB
#define EPWM_MINDBCFG_INVERTB     0x40000U     // Invert the selected reference signal on PWMB
#define EPWM_MINDBCFG_SELBLOCKB   0x80000U     // BLOCK signal source select on PWMB
#define EPWM_MINDBCFG_SELB_S      20U
#define EPWM_MINDBCFG_SELB_M      0xF00000U    // Reference source select on PWMB min dead band
                                               // logic.
#define EPWM_MINDBCFG_POLSELB     0x1000000U   // Select signal for the AND OR logic of PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBDLY register
//
//*************************************************************************************************
#define EPWM_MINDBDLY_DELAYA_S   0U
#define EPWM_MINDBDLY_DELAYA_M   0xFFFFU       // Minimum dead band delay on PWMA
#define EPWM_MINDBDLY_DELAYB_S   16U
#define EPWM_MINDBDLY_DELAYB_M   0xFFFF0000U   // Minimum dead band delay on PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLA register
//
//*************************************************************************************************
#define EPWM_LUTCTLA_BYPASS      0x1U        // Bypass LUTA
#define EPWM_LUTCTLA_SELXBAR_S   4U
#define EPWM_LUTCTLA_SELXBAR_M   0xF0U       // ICSS XBAR select
#define EPWM_LUTCTLA_LUTDEC0     0x10000U    // LUT output PWMA value on decoding 0
#define EPWM_LUTCTLA_LUTDEC1     0x20000U    // LUT output PWMA value on decoding 1
#define EPWM_LUTCTLA_LUTDEC2     0x40000U    // LUT output PWMA value on decoding 2
#define EPWM_LUTCTLA_LUTDEC3     0x80000U    // LUT output PWMA value on decoding 3
#define EPWM_LUTCTLA_LUTDEC4     0x100000U   // LUT output PWMA value on decoding 4
#define EPWM_LUTCTLA_LUTDEC5     0x200000U   // LUT output PWMA value on decoding 5
#define EPWM_LUTCTLA_LUTDEC6     0x400000U   // LUT output PWMA value on decoding 6
#define EPWM_LUTCTLA_LUTDEC7     0x800000U   // LUT output PWMA value on decoding 7

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLB register
//
//*************************************************************************************************
#define EPWM_LUTCTLB_BYPASS      0x1U        // Bypass LUTB
#define EPWM_LUTCTLB_SELXBAR_S   4U
#define EPWM_LUTCTLB_SELXBAR_M   0xF0U       // ICSS XBAR select
#define EPWM_LUTCTLB_LUTDEC0     0x10000U    // LUT output PWMB value on decoding 0
#define EPWM_LUTCTLB_LUTDEC1     0x20000U    // LUT output PWMB value on decoding 1
#define EPWM_LUTCTLB_LUTDEC2     0x40000U    // LUT output PWMB value on decoding 2
#define EPWM_LUTCTLB_LUTDEC3     0x80000U    // LUT output PWMB value on decoding 3
#define EPWM_LUTCTLB_LUTDEC4     0x100000U   // LUT output PWMB value on decoding 4
#define EPWM_LUTCTLB_LUTDEC5     0x200000U   // LUT output PWMB value on decoding 5
#define EPWM_LUTCTLB_LUTDEC6     0x400000U   // LUT output PWMB value on decoding 6
#define EPWM_LUTCTLB_LUTDEC7     0x800000U   // LUT output PWMB value on decoding 7



#endif
